In [1]:
import os, pandas as pd,numpy as np
os.chdir(r'D:\새 폴더\Programing\Academy\Python\day0826')

In [2]:
# 통계 함수
# np.random.rand(3,4) : 0 이상 1미만의 랜덤값으로 3행 4열의 배열 생성
# np.random.randint(1,10,size=(3,4)) : 1-9 사이의 랜덤값으로 3행 4열 배열 생성
df1=pd.DataFrame(np.random.rand(3,4),index=["R1","R2","R3"],columns=["C1","C2","C3","C4"])
df2=pd.DataFrame(np.random.randint(1,10,size=(3,4)),index=["R1","R2","R3"],columns=["C1","C2","C3","C4"])

display(df1)
display(df2)

          C1        C2        C3        C4
R1  0.790940  0.448846  0.641886  0.515848
R2  0.471691  0.680433  0.452397  0.018384
R3  0.148036  0.162689  0.643679  0.194684

    C1  C2  C3  C4
R1   8   9   9   7
R2   3   5   1   2
R3   6   7   4   6

In [3]:
# 열별 합을 구하기
df2.sum()

C1    17
C2    21
C3    14
C4    15
dtype: int64

In [4]:
# 행별 합을 구하기
df2.sum(axis=1)

R1    33
R2    11
R3    23
dtype: int64

In [5]:
# 열별 평균 구하기
df2.mean()

C1    5.666667
C2    7.000000
C3    4.666667
C4    5.000000
dtype: float64

In [6]:
# 행별 평균 구하기
df2.mean(axis=1)

R1    8.25
R2    2.75
R3    5.75
dtype: float64

In [7]:
# 열별 최대값이 들어있는 행의 index를 출력
df2.idxmax()

C1    R1
C2    R1
C3    R1
C4    R1
dtype: object

In [8]:
display(df2)
# 열별로 누적하여 계산
df2.cumsum()

    C1  C2  C3  C4
R1   8   9   9   7
R2   3   5   1   2
R3   6   7   4   6

    C1  C2  C3  C4
R1   8   9   9   7
R2  11  14  10   9
R3  17  21  14  15

In [ ]:
# 기초 통계 요약 - 열별 개수, 평균, 표준편차, 최소값, 4분위값, 최대값
# describe() , 숫자로 이루어진 값만 다룸
df2.describe()

             C1   C2        C3        C4
count  3.000000  3.0  3.000000  3.000000
mean   5.666667  7.0  4.666667  5.000000
std    2.516611  2.0  4.041452  2.645751
min    3.000000  5.0  1.000000  2.000000
25%    4.500000  6.0  2.500000  4.000000
50%    6.000000  7.0  4.000000  6.000000
75%    7.000000  8.0  6.500000  6.500000
max    8.000000  9.0  9.000000  7.000000

In [10]:
#csv 읽기 및 확인
df=pd.read_csv('./data_analysis/score/survey.csv')
df.head()

  gender  income
0      m    3000
1      f    4000
2      f    5000
3      m    6800
4      m    6200

In [11]:
# 그냥 해본거. 수입 많은순 5개
df.sort_values('income',ascending=False).head()

   gender  income
16      m    8000
13      f    8000
14      m    7000
17      f    6999
3       m    6800

In [12]:
# 특정 컬럼값의 평균
df.income.mean()

np.float64(5534.4)

In [13]:
# 특정 컬럼값의 합
df.income.sum()

np.int64(110688)

In [14]:
# 특정 컬럼의 중앙값
df.income.median() #중앙값

np.float64(5250.0)

In [15]:
# 통계요약, 숫자가 아닌 값(gender)은 출력x
df.describe()

            income
count    20.000000
mean   5534.400000
std    1407.357262
min    3000.000000
25%    4997.500000
50%    5250.000000
75%    6425.000000
max    8000.000000

In [16]:
# 컬럼명을 지정해서 사용가능
df.income.describe()

count      20.000000
mean     5534.400000
std      1407.357262
min      3000.000000
25%      4997.500000
50%      5250.000000
75%      6425.000000
max      8000.000000
Name: income, dtype: float64

In [17]:
# 특정 값이 몇개있는지 count
df.gender.value_counts()

gender
m    11
f     9
Name: count, dtype: int64

In [18]:
# groupby : 그룹화
display(df.groupby(df.gender).describe())
df.groupby('gender').describe()

#둘다 성별(gender)을 그룹화 하여 describe()

       income                                                            \
        count         mean          std     min     25%     50%     75%
gender
f         9.0  5409.888889  1321.647688  4000.0  4990.0  5000.0  5700.0
m        11.0  5636.272727  1529.860392  3000.0  5000.0  5999.0  6550.0


           max
gender
f       8000.0
m       8000.0

       income                                                            \
        count         mean          std     min     25%     50%     75%
gender
f         9.0  5409.888889  1321.647688  4000.0  4990.0  5000.0  5700.0
m        11.0  5636.272727  1529.860392  3000.0  5000.0  5999.0  6550.0


           max
gender
f       8000.0
m       8000.0

In [19]:
df.groupby('gender').mean()

             income
gender
f       5409.888889
m       5636.272727